//id coin crystal cae possible
var fallThings = [[0, 5, 0, 0, 20], [1, 10, 0, 0, 15], [2, 20, 0, 0, 15], [3, 30, 0, 0, 15], [4, 40, 0, 0, 15], [5, 50, 0, 0, 5], [6, 0, 0, 1, 2], [7, 0, 2, 0, 1], [8, 0, 1, 0, 2], [9, 100, 0, 0, 10]];
//id costSilver costCrystal costGold kind/farm/normal-->which zone sx sy
var buildingData = dict([
    [0, [0, 100, 0, 0, 0, 2, 2, "普通农田"]], 
    [1, [1, 0, 100, 0, 0, 2, 2, "魔法农田"]]]);

//level time cost gain exp name
var plantData = [
[1, 20, 10, 40, 1, "小麦"],
[1, 10*60, 10, 40, 1, "小麦"],
[1, 10*60, 10, 40, 1, "小麦"],
[1, 10*60, 10, 40, 1, "小麦"],
[1, 10*60, 10, 40, 1, "小麦"],
[1, 10*60, 10, 40, 1, "小麦"],
[1, 10*60, 10, 40, 1, "小麦"],
[1, 10*60, 10, 40, 1, "小麦"],
[1, 10*60, 10, 40, 1, "小麦"],
[1, 10*60, 10, 40, 1, "小麦"],
];

